#include <iostream>

int main()
{
	// 여태까지 배운거 되짚을거에요.
	// 


	// What Why How
	//


	// 1. 출력
	// What : 콘솔창에 내가 원하고자 하는 문자열을 출력하는 것
	// Why : 출력을 안하면 화면에 아무것도 안나옴. 사용자에게 안내하기 위함.
	// How : printf("문자열");
	//		 cout << "문자열";

	// 2. 변수 
	// What : 값을 저장하는 공간
	// Why : 내가 저장한 값을 꺼내쓰기 위해서 사용
	// How : int, bool, char, float ==> 자료형
	
	// 변수 선언 공식
	// 자료형 변수명 = 값;
	// 자료형 변수명;
	// ** 모든 변수에는 목적이 있음. **
	// 변수명 = 값;
	
	// 2-1. 변수 사칙연산
	// 종류 : 
	//	 +, -, *, /, %
	//  a += 5 ==> a = a + 5
	//  -=, *=, /=, %=

	// 3. 입력
	// What : 런타임 도중, 사용자 입력을 변수에 값을 넣는 것
	// Why : 사용자 입력을 기억하고 싶을때 사용.
	// How : 
	//	cin >> 변수명;
	//	scanf_s("%d", &변수명);

	// 4. 제어문
	// What : 조건에따라 결과를 다르게 하려고 하는 것
	// Why : 조건에따라 결과를 다르게 하기 위해
	// How : if, else if, else
	
	// 5. 반복문
	// What : 반복하는 것 (문법에 따라 조건, 횟수로 반복가능)
	// Why : 똑같은 느낌의 문장을 실행시키고 싶을때 사용
	// How : while, for, continue (반복 다시), break (반복 탈출)

	// 6. 논리연산자
	// What : bool 값으로 나오게하는 연산자
	// Why : 반복문이나 제어문에서 true, false 조건을 주기위해
	// How : >, <, ==, !=, <=, >=   ==> true, false
	//		int hp = 100;
	//		bool isAlive = hp > 0;

	// 7. 비트연산자
	//  안배웠고, 안배울거에요
	//  거의 안써요.
	//  특정 기법에만 사용


	return 0;
}