#include <iostream>
#include <time.h>

using namespace std;
void main()
{
	srand(time(NULL));
	// 1. 구구단
	// 
	// 1 x 1 = 1
	// 1 x 2 = 2
	// .
	// .
	// .
	// 1 x 9 = 9
	// 2 x 1 = 2
	// .
	// .
	// .
	// 9 x 9 = 81

	//[추가숙제!]
	// 1 x 1 = 1	2 x 1 = 2	3 x 1 = 3
	// 1 x 2 = 2	2 x 2 = 4	3 x 2 = 6
	// 1 x 3 = 3	2 x 3 = 6	3 x 3 = 9
	// .
	// .
	// .
	// 7 x 9 = 63	8 x 9 = 72	9 x 9 = 81

	//2. 1 ~ 1000까지의 숫자중에서 2의 배수와 3의 배수를 합한 값
	//	 그중에서 6의배수는 더하지 않음.
	
	// [더하는숫자] 2, 3, 4, 8, 9 , 12
	// [XXX] 6

	// [추가숙제!!]
	// 1 ~ 1000까지 숫자중에서 소수만 더해서 그값을 출력
	
	// 1과 자기숫자말고는 안나눠지는 수


	//3. 로또번호 생성기
	// 1~45숫자가 있을때, 7개의 랜덤 숫자를 출력한다 (이떄 겹치면안됨)


	//4. 가위바위보 하나빼기 타임어택
	// 수업코드 기반 (15분정도)
}