#include <iostream>
using namespace std;

void main()
{
	// 실습시간 (못하면 주말숙제)
	// 1. 랜덤 숫자 맞추기 (UP DOWN 스무고개)


	// 랜덤숫자가 정해졌습니다. 
	// 
	// 숫자를 입력해주세요(1 ~ 100) : 
	// [입력] 사용자 : (3)
	// UP
	// 
	// 숫자를 입력해주세요(3 ~ 100) :
	// [입력] 사용자 : (47)
	// DOWN
	// 
	// 숫자를 입력해주세요(3 ~ 47) :
	// [입력] 사용자 : (25)
	// 정답입니다.



	//수도코드 : 
	// 1. 랜덤숫자를 정한다.
	// 2. 랜덤숫자가 정해졌습니다. 출력
	// 3. 반복 실행
	// 4.	숫자를 입력받는다.
	// 5.   입력받은 숫자를 비교해서  UP DOWN 정답 판별


	// 1. 랜덤숫자를 정한다. ( 1 ~ 100 사이의 랜덤숫자)
	int answer = rand() % 100 + 1;

	while (true)
	{

	}


}