#include <iostream>
using namespace std;

void main()
{
	// Intelligence
	// 도구 - 옵션
	// 환경 - 글꼴 - Consolas
	// 텍스트 편집기 - C/C++ - 줄번호

	// Intelligence
	// 툴에서 자체적으로 편의성 기능 ex) 여기서 엔터치면 탭이 자동으로 하나 쳐져있는거라던가 { " ( 이런거 만들면 자동으로 } " ) 만들어 지는거 등등

	// 1. 한개의 중괄호당 탭 1개
	// 2. 자동 줄맞춤 (Ctrl + a 이후 Ctrl + k + f)    중요!! Ctrl + a를 통해 전체를 드래그 한 뒤 Ctrl + k + f 하면 자동으로 줄 맞춰줌
	// 3. Ctrl + Space -> Intelligence 실행, 자동 문장 완성
	// 4. 커서를 해당라인 끝에 두고 Ctrl + C(X), Ctrl + V
	// 5. Alt + 드래그 
	//------------------------------------------------
	//--------alt + 드래그하면 그 부분을 한번에 바꿀 수 있음-------
	//--------alt + 드래그하면 그 부분을 한번에 바꿀 수 있음-------
	//--------alt + 드래그하면 그 부분을 한번에 바꿀 수 있음-------
	//--------alt + 드래그하면 그 부분을 한번에 바꿀 수 있음-------
	//--------alt + 드래그하면 그 부분을 한번에 바꿀 수 있음-------
	//------------------------------------------------
	// 6. 더블클릭 -> 단어 단위로 잡힘

	cout << "aaaa"; //만일 에러가 마지막에 잡히면 그 전줄에 문제가 있다는 것

}