#include <iostream>
#include <time.h>
using namespace std;

void main()
{

	// 주말 숙제 
	// 1. 구구단

	// 1 x 1 = 1
	// 1 x 2 = 2
	// 1 x 3 = 3
	// .
	// .
	// .
	// 1 x 9 = 9
	// 2 x 1 = 2
	// .
	// .
	// .
	// 9 x 9 = 81

	// 1번 [추가숙제]
	// 1 x 1 = 1	2 x 1 = 2	3 x 1 = 3
	// 1 x 2 = 2	2 x 2 = 4	3 x 2 = 6
	// .
	// .
	// .
	// 7 x 9 = 63	8 x 9 = 72	9 x 9 = 81

	// 2. 1 ~1000 까지의 숫자 중에서 2의 배수와 3의 배수를 합한 값
	// 다만 6의 배수는 더하지 않는다.

	// 2번 [추가숙제]
	// 1 ~ 1000까지 숫자 중에서 소수만 더해서 출력

	// 3. 로또번호 생성기 
	// 1 ~ 45 숫자가 있을 때, 7개의 랜덤 볼을 출력한다.(이때 숫자가 겹치면 안된다.)

	// 4. 가위바위보 하나빼기 타임어택
	// 수업 코드 기반(15분 안에)
}